package com.javaguru.student_vitalijs_usakovs.lesson_2.Homework.level_x;
/* Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного коментариев. */
public class Super_task_5 {
    public static void main(String[] args){
        System.out.println("Многострочный коментарий-1 ");
        System.out.println("Многострочный коментарий-2 ");
        System.out.print("Однострочный коментарий-1 ");
        System.out.print("Однострочный коментарий-2 ");
    }
}
