//Дан код, нужно сделать этот код запускаемым.
package com.javaguru.student_rodions_sokolovs.lesson_2;
public class Level_2_7 {

    public static void main(String[] args) {

        System.out.println("You can login!");
    }


}
