package com.javaguru.student_vadim_babchenok.lesson5home.lesson3junior.task16;

import com.javaguru.teacher.codereview.CodeReview;

//Найдите ошибку в программе и исправить её:
@CodeReview(approved = true)
public class ForLoopDefinition1 {
    public static void main(String[] args) {
        for (int i=0; i < 10; i++) {
            System.out.println(i);
        }
    }

//Не было указано начальное значение переменной i


}
