package com.javaguru.student_jekaterina_ola.lesson_5.level_2_intern.Task_10;

//Написать программу, в которой:
// - создать массив целых чисел длиной 3,
// - заполнить каждую ячейку массива любым числом,
// - вывести значение каждой ячейки на консоль.

public class ArrayTask10 {
    public static void main(String[] args) {
        int[] numbers = new int[3];
        System.out.println(numbers[0]);
        System.out.println(numbers[1]);
        System.out.println(numbers[2]);
    }
}

