package com.javaguru.student_ruslan_pankratov.lesson_12.level_4;

class Task_24 {
//- ArrayIndexOutOfBoundsException  чтобы указать, что к массиву обращались с недопустимым индексом.
// Индекс либо отрицателен, либо больше или равен размеру массива.

//- IllegalArgumentException чтобы указать, что методу был передан недопустимый или несоответствующий аргумент.

//- IOException Сигналы о том, что произошло какое-то исключение ввода-вывода. Этот класс является общим классом
// исключений, вызванных неудачными или прерванными операциями ввода-вывода.

//- StackOverflowError Вызывается, когда происходит переполнение стека из-за слишком глубокой рекурсии приложения.

//- OutOfMemoryError Вызывается, когда виртуальная машина Java не может выделить объект, потому что ему не хватает
// памяти, и сборщик мусора не может сделать больше памяти. OutOfMemoryErrorобъекты могут быть созданы виртуальной машиной,
// как если бы подавление было отключено и / или трассировка стека не была доступна для записи .

//- NumberFormatException Брошено, чтобы указать, что приложение попыталось преобразовать строку в один из числовых
// типов, но строка не имеет соответствующего формата.
}
