package com.javaguru.student_mihails_mihejevs.lesson_2;
/*
При программировании более удобно и быстро выполнять все
действия с помощью клавиатуры, не переключаясь на мышку.

Научитесь без мышки создавать новый класс!

Alt (слева) + 1 - открывает окно Project в котором видна структура проекта.

Вызывает всплывающее меню используя клавиатуру.

Стрелочки: вверх, вниз, влево, вправо - помогают выбирать
нужный пункт меню.

Enter - после введения названия нового класса.

1
 */
public class hw_task_16 {
}
