
//Команда System.out.println("text"); выводит указанный "text"
//на консоль, и переводит курсор на новую строку.
//
//Для того, что бы выводить текст на консоль без перевода курсора на
//новую строку можно воспользоваться командой
//System.out.print("text");
//эта команда распечатает текст на консоль и оставит курсор в той же строке.
//
//Напишите программу, которая демонстрирует использование команды
//System.out.print("text");



package com.javaguru.student_rodions_sokolovs.lesson_2.level_5;

import com.javaguru.student_maksims_jagelavics.student_vadim_babchenok.teacher.codereview.CodeReview;

@CodeReview(approved = true)
public class Level_5_15 {
    public static void main(String[] args) {
        System.out.print("text");
    }
}